src/test/resources/soap/exampleEscapedMessage.ftl

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:soap="http://soap.nl.ilionx.com/">
    <soapenv:Header/>
    <soapenv:Body>
        <soap:doSomething>
            <secondValue>&lt;StockQuotes&gt;&lt;Stock&gt;&lt;Symbol&gt;helloworld&lt;/Symbol&gt;&lt;Last&gt;N/A&lt;/Last&gt;&lt;Date&gt;N/A&lt;/Date&gt;&lt;Time&gt;N/A&lt;/Time&gt;&lt;Change&gt;N/A&lt;/Change&gt;&lt;Open&gt;N/A&lt;/Open&gt;&lt;High&gt;N/A&lt;/High&gt;&lt;Low&gt;N/A&lt;/Low&gt;&lt;Volume&gt;N/A&lt;/Volume&gt;&lt;MktCap&gt;N/A&lt;/MktCap&gt;&lt;PreviousClose&gt;N/A&lt;/PreviousClose&gt;&lt;PercentageChange&gt;N/A&lt;/PercentageChange&gt;&lt;AnnRange&gt;N/A&lt;/AnnRange&gt;&lt;Earns&gt;N/A&lt;/Earns&gt;&lt;P-E&gt;N/A&lt;/P-E&gt;&lt;Name&gt;N/A&lt;/Name&gt;&lt;/Stock&gt;&lt;/StockQuotes&gt;</secondValue>
        </soap:doSomething>
    </soapenv:Body>
</soapenv:Envelope>